# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
import  math
t = int(input('введите точность: '))
print(round(math.pi,t))